-- phpMyAdmin SQL Dump
-- version 5.1.0
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Июн 22 2021 г., 08:42
-- Версия сервера: 10.4.19-MariaDB
-- Версия PHP: 7.3.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `site`
--

-- --------------------------------------------------------

--
-- Структура таблицы `comment`
--

CREATE TABLE `comment` (
  `id` tinyint(10) NOT NULL,
  `autor` varchar(100) NOT NULL,
  `text` text NOT NULL,
  `date` date NOT NULL,
  `page_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `comment`
--

INSERT INTO `comment` (`id`, `autor`, `text`, `date`, `page_id`) VALUES
(1, '444', '123', '0000-00-00', 1),
(2, '444', '123', '0000-00-00', 2);

-- --------------------------------------------------------

--
-- Структура таблицы `likes`
--

CREATE TABLE `likes` (
  `id` int(10) NOT NULL,
  `client_ip` varchar(10) NOT NULL,
  `article_id` int(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `likes`
--

INSERT INTO `likes` (`id`, `client_ip`, `article_id`) VALUES
(1, '', 0),
(2, '1', 0);

-- --------------------------------------------------------

--
-- Структура таблицы `post`
--

CREATE TABLE `post` (
  `id` int(10) NOT NULL,
  `Title` char(255) NOT NULL,
  `Intro` text NOT NULL,
  `Text` text NOT NULL,
  `Published_date` date NOT NULL,
  `Foto` text NOT NULL,
  `autor` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `post`
--

INSERT INTO `post` (`id`, `Title`, `Intro`, `Text`, `Published_date`, `Foto`, `autor`) VALUES
(1, 'Только зима близко', 'Кстати, непосредственные участники технического прогресса и по сей день остаются уделом либералов, которые жаждут быть ограничены исключительно образом мышления. Значимость этих проблем настолько очевидна, что семантический разбор внешних противодействий не даёт нам иного выбора, кроме определения своевременного выполнения сверхзадачи. Предварительные выводы неутешительны: современная методология разработки требует от нас анализа прогресса профессионального сообщества', 'Кстати, непосредственные участники технического прогресса и по сей день остаются уделом либералов, которые жаждут быть ограничены исключительно образом мышления. Значимость этих проблем настолько очевидна, что семантический разбор внешних противодействий не даёт нам иного выбора, кроме определения своевременного выполнения сверхзадачи. Предварительные выводы неутешительны: современная методология разработки требует от нас анализа прогресса профессионального сообщества.\r\nНе следует, однако забывать, что укрепление и развитие структуры представляет собой интересный эксперимент проверки позиций, занимаемых участниками в отношении поставленных задач. Не следует, однако забывать, что реализация намеченных плановых заданий позволяет выполнять важные задания по разработке позиций, занимаемых участниками в отношении поставленных задач.\r\nРазнообразный и богатый опыт рамки и место обучения кадров позволяет оценить значение модели развития. С другой стороны реализация намеченных плановых заданий влечет за собой процесс внедрения и модернизации новых предложений. Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности играет важную роль в формировании существенных финансовых и административных условий. Значимость этих проблем настолько очевидна, что консультация с широким активом способствует подготовки и реализации модели развития.', '2021-06-15', 'https://www.wallpapers.net/web/wallpapers/flatirons-hd-wallpaper/250x250.jpg', ''),
(2, 'Производство', 'Товарищи! новая модель организационной деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития. Равным образом дальнейшее развитие различных форм деятельности требуют от нас анализа новых предложений. С другой стороны дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития.', 'Товарищи! новая модель организационной деятельности представляет собой интересный эксперимент проверки направлений прогрессивного развития. Равным образом дальнейшее развитие различных форм деятельности требуют от нас анализа новых предложений. С другой стороны дальнейшее развитие различных форм деятельности требуют от нас анализа форм развития.\r\nС другой стороны постоянный количественный рост и сфера нашей активности требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. Идейные соображения высшего порядка, а также сложившаяся структура организации обеспечивает широкому кругу (специалистов) участие в формировании модели развития. Задача организации, в особенности же рамки и место обучения кадров требуют от нас анализа существенных финансовых и административных условий. Идейные соображения высшего порядка, а также укрепление и развитие структуры требуют от нас анализа системы обучения кадров, соответствует насущным потребностям. Идейные соображения высшего порядка, а также дальнейшее развитие различных форм деятельности способствует подготовки и реализации дальнейших направлений развития.\r\nИдейные соображения высшего порядка, а также постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании дальнейших направлений развития. Равным образом начало повседневной работы по формированию позиции представляет собой интересный эксперимент проверки существенных финансовых и административных условий.', '2020-03-21', 'https://i.vestor-ru.ru/get-marketpic/204557/market_3q4CyyDDwL6fnV4v9SQY0Q/200x200', ''),
(5, 'test', 'test', 'test', '2021-06-02', 'test', 'z2014'),
(6, 'test1', 'test1', 'test1', '2021-06-09', 'test1', 'z2014');

-- --------------------------------------------------------

--
-- Структура таблицы `user`
--

CREATE TABLE `user` (
  `id` int(10) NOT NULL,
  `login` char(15) NOT NULL,
  `password` char(255) NOT NULL,
  `email` char(30) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Дамп данных таблицы `user`
--

INSERT INTO `user` (`id`, `login`, `password`, `email`) VALUES
(1, 'z2014', '$2y$10$NnfvVSJYKa2aqwGAHk5gYuyzTKBr60Frz0Lk5vzvyuBW3/tepEDwy', 'vi205031@gmail.com');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `comment`
--
ALTER TABLE `comment`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `likes`
--
ALTER TABLE `likes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `client_ip` (`client_ip`,`article_id`);

--
-- Индексы таблицы `post`
--
ALTER TABLE `post`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `user`
--
ALTER TABLE `user`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `comment`
--
ALTER TABLE `comment`
  MODIFY `id` tinyint(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `likes`
--
ALTER TABLE `likes`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT для таблицы `post`
--
ALTER TABLE `post`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;

--
-- AUTO_INCREMENT для таблицы `user`
--
ALTER TABLE `user`
  MODIFY `id` int(10) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
